Revit 2024 API
Connector Methods
The Connector type exposes the following members.
Methods
Name | Description
ConnectTo
Make connection between two connectors.
DisconnectFrom
Remove connection between two connectors.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFabricationConnectorInfo
 Gets fabrication connectivity information.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMEPConnectorInfo
 Gets MEP connector information.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsConnectedTo
Identifies if the connector is connected to the specified connector.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Connector Class
Autodesk.Revit.DB Namespace